03_mesh_independence/layered_case_v2/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     simpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         1500;

deltaT          1;

writeControl    timeStep;

writeInterval   100;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    forceCoeffs
    {
        type            forceCoeffs;
        libs            (forces);

        patches         (airfoil);

        rho             rhoInf;
        rhoInf          1.225;

        CofR            (0 0 0);

        liftDir         (0 1 0);
        dragDir         (1 0 0);
        pitchAxis       (0 0 1);

        magUInf         20;

        lRef            0.20;
        Aref            0.004;

        writeControl    timeStep;
        writeInterval   1;
    }

    yPlus
    {
        type            yPlus;
        libs            (fieldFunctionObjects);

        writeControl    timeStep;
        writeInterval   100;
    }

    residuals
    {
        type            residuals;
        libs            (utilityFunctionObjects);

        fields
        (
            U
            p
            nuTilda
        );

        writeControl    timeStep;
        writeInterval   1;
    }
}
