03_mesh_independence/layered_case_v2/system/blockMeshDict

FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

vertices
(
    (-1.0 -1.0 -0.01)
    (2.2 -1.0 -0.01)
    (2.2 1.0 -0.01)
    (-1.0 1.0 -0.01)
    (-1.0 -1.0 0.01)
    (2.2 -1.0 0.01)
    (2.2 1.0 0.01)
    (-1.0 1.0 0.01)
);
blocks
(
    hex (0 1 2 3 4 5 6 7) (160 100 10) simpleGrading (1 1 1)
);
boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    topandbottom
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (0 1 5 4)
        );
    }
        front
        {
            type symmetryPlane;
            faces
            (
                (0 3 2 1)
            );
        }
   back
   {type symmetryPlane;
    faces
    (
        (4 5 6 7)
    );
}
);
