03_mesh_independence/layered_case_v2/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (20 0 0);

boundaryField
{
    inlet
    {
        type            freestreamVelocity;
        freestreamValue uniform (20 0 0);
    }

    outlet
    {
        type            freestreamVelocity;
        freestreamValue uniform (20 0 0);
    }

    topandbottom
    {
        type            freestreamVelocity;
        freestreamValue uniform (20 0 0);
    }

    front
    {
        type            symmetryPlane;
    }

    back
    {
        type            symmetryPlane;
    }

    airfoil
    {
        type            noSlip;
    }
}
